; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-5-37)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-1 - location
	p0-3 - location
	p0-4 - location
	p0-5 - location
	p1-2 - location
	p1-5 - location
	p1-8 - location
	p2-6 - location
	p3-7 - location
	p4-6 - location
	p4-7 - location
	p5-0 - location
	p5-3 - location
	p6-1 - location
	p6-5 - location
	p7-1 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s2)
	(at driver3 s4)
	(at driver4 s4)
	(at driver5 s5)
	(at driver6 s3)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s8)
	(empty truck2)
	(at truck3 s6)
	(empty truck3)
	(at truck4 s7)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at package1 s1)
	(at package2 s8)
	(at package3 s2)
	(at package4 s1)
	(at package5 s4)
	(at package6 s4)
	(at package7 s0)
	(at package8 s0)
	(at package9 s5)
	(at package10 s6)
	(at package11 s5)
	(at package12 s5)
	(at package13 s1)
	(at package14 s8)
	(at package15 s7)
	(at package16 s0)
	(at package17 s5)
	(at package18 s2)
	(at package19 s3)
	(at package20 s3)
	(at package21 s6)
	(at package22 s6)
	(at package23 s7)
	(at package24 s5)
	(at package25 s6)
	(at package26 s4)
	(at package27 s6)
	(at package28 s1)
	(at package29 s6)
	(at package30 s1)
	(at package31 s7)
	(at package32 s1)
	(at package33 s8)
	(at package34 s3)
	(at package35 s7)
	(at package36 s4)
	(at package37 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(link s0 s3)
	(link s3 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s7)
	(link s7 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s6)
	(link s6 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s5)
	(link s5 s4)
	(link s4 s7)
	(link s7 s4)
	(link s4 s8)
	(link s8 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s1)
	(link s1 s5)
	(link s5 s2)
	(link s2 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s1)
	(link s1 s6)
	(link s6 s5)
	(link s5 s6)
	(link s8 s1)
	(link s1 s8)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s2)
	(at driver3 s4)
	(at driver4 s1)
	(at driver5 s1)
	(at truck1 s3)
	(at truck3 s4)
	(at truck5 s3)
	(at package1 s6)
	(at package2 s1)
	(at package3 s5)
	(at package4 s2)
	(at package5 s6)
	(at package6 s3)
	(at package7 s2)
	(at package8 s0)
	(at package9 s8)
	(at package10 s3)
	(at package12 s4)
	(at package13 s6)
	(at package14 s7)
	(at package15 s3)
	(at package16 s7)
	(at package17 s8)
	(at package18 s0)
	(at package19 s5)
	(at package20 s3)
	(at package21 s0)
	(at package22 s6)
	(at package23 s7)
	(at package24 s7)
	(at package25 s5)
	(at package26 s5)
	(at package27 s2)
	(at package28 s4)
	(at package29 s8)
	(at package30 s2)
	(at package31 s8)
	(at package32 s6)
	(at package33 s5)
	(at package34 s2)
	(at package35 s8)
	(at package36 s4)
	(at package37 s1)
	))


)

; plan
1. (board-truck driver5 s5 truck1)
   deleted: (at driver5 s5) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 8 of 44
2. (board-truck driver1 s4 truck5)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 8 of 44
3. (drive-truck driver5 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 8 of 44
4. (load-truck s1 package4 truck1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   goals met: 8 of 44
5. (load-truck s1 package32 truck1)
   deleted: (at package32 s1)
   added: (in package32 truck1)
   goals met: 8 of 44
6. (drive-truck driver5 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 8 of 44
7. (unload-truck s6 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s6)
   goals met: 9 of 44
8. (load-truck s6 package29 truck1)
   deleted: (at package29 s6)
   added: (in package29 truck1)
   goals met: 9 of 44
9. (drive-truck driver5 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 9 of 44
10. (load-truck s1 package30 truck1)
   deleted: (at package30 s1)
   added: (in package30 truck1)
   goals met: 9 of 44
11. (load-truck s1 package28 truck1)
   deleted: (at package28 s1)
   added: (in package28 truck1)
   goals met: 9 of 44
12. (load-truck s1 package13 truck1)
   deleted: (at package13 s1)
   added: (in package13 truck1)
   goals met: 9 of 44
13. (drive-truck driver5 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 9 of 44
14. (drive-truck driver5 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 9 of 44
15. (load-truck s6 package27 truck1)
   deleted: (at package27 s6)
   added: (in package27 truck1)
   goals met: 9 of 44
16. (drive-truck driver5 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 9 of 44
17. (unload-truck s2 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 10 of 44
18. (unload-truck s2 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s2)
   goals met: 11 of 44
19. (drive-truck driver5 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 11 of 44
20. (load-truck s5 package9 truck1)
   deleted: (at package9 s5)
   added: (in package9 truck1)
   goals met: 11 of 44
21. (drive-truck driver5 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 11 of 44
22. (load-truck s1 package1 truck1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 11 of 44
23. (drive-truck driver5 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 11 of 44
24. (load-truck s6 package25 truck1)
   deleted: (at package25 s6)
   added: (in package25 truck1)
   goals met: 11 of 44
25. (load-truck s6 package21 truck1)
   deleted: (at package21 s6)
   added: (in package21 truck1)
   goals met: 11 of 44
26. (drive-truck driver5 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 11 of 44
27. (unload-truck s5 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s5)
   goals met: 12 of 44
28. (load-truck s5 package24 truck1)
   deleted: (at package24 s5)
   added: (in package24 truck1)
   goals met: 12 of 44
29. (drive-truck driver5 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 12 of 44
30. (load-truck s4 package6 truck5)
   deleted: (at package6 s4)
   added: (in package6 truck5)
   goals met: 12 of 44
31. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 12 of 44
32. (drive-truck driver1 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 13 of 44
33. (unload-truck s3 package6 truck5)
   deleted: (in package6 truck5)
   added: (at package6 s3)
   goals met: 14 of 44
34. (load-truck s3 package34 truck5)
   deleted: (at package34 s3)
   added: (in package34 truck5)
   goals met: 14 of 44
35. (load-truck s3 package19 truck5)
   deleted: (at package19 s3)
   added: (in package19 truck5)
   goals met: 14 of 44
36. (drive-truck driver1 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 13 of 44
37. (drive-truck driver1 s0 s5 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s5)
   goals met: 13 of 44
38. (unload-truck s5 package19 truck5)
   deleted: (in package19 truck5)
   added: (at package19 s5)
   goals met: 14 of 44
39. (load-truck s5 package17 truck5)
   deleted: (at package17 s5)
   added: (in package17 truck5)
   goals met: 14 of 44
40. (drive-truck driver1 s5 s0 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s0)
   goals met: 14 of 44
41. (load-truck s0 package7 truck5)
   deleted: (at package7 s0)
   added: (in package7 truck5)
   goals met: 14 of 44
42. (drive-truck driver1 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 15 of 44
43. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 14 of 44
44. (unload-truck s2 package7 truck5)
   deleted: (in package7 truck5)
   added: (at package7 s2)
   goals met: 15 of 44
45. (unload-truck s2 package34 truck5)
   deleted: (in package34 truck5)
   added: (at package34 s2)
   goals met: 16 of 44
46. (load-truck s2 package3 truck5)
   deleted: (at package3 s2)
   added: (in package3 truck5)
   goals met: 16 of 44
47. (drive-truck driver1 s2 s5 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s5)
   goals met: 16 of 44
48. (drive-truck driver1 s5 s4 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   goals met: 16 of 44
49. (load-truck s4 package5 truck5)
   deleted: (at package5 s4)
   added: (in package5 truck5)
   goals met: 16 of 44
50. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 16 of 44
51. (drive-truck driver1 s0 s6 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   goals met: 16 of 44
52. (unload-truck s6 package5 truck5)
   deleted: (in package5 truck5)
   added: (at package5 s6)
   goals met: 17 of 44
53. (load-truck s6 package10 truck5)
   deleted: (at package10 s6)
   added: (in package10 truck5)
   goals met: 17 of 44
54. (drive-truck driver1 s6 s0 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s0)
   goals met: 17 of 44
55. (load-truck s0 package16 truck5)
   deleted: (at package16 s0)
   added: (in package16 truck5)
   goals met: 17 of 44
56. (drive-truck driver1 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 17 of 44
57. (load-truck s4 package26 truck5)
   deleted: (at package26 s4)
   added: (in package26 truck5)
   goals met: 17 of 44
58. (drive-truck driver1 s4 s5 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   goals met: 17 of 44
59. (unload-truck s5 package3 truck5)
   deleted: (in package3 truck5)
   added: (at package3 s5)
   goals met: 18 of 44
60. (drive-truck driver1 s5 s7 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   goals met: 18 of 44
61. (load-truck s7 package35 truck5)
   deleted: (at package35 s7)
   added: (in package35 truck5)
   goals met: 18 of 44
62. (drive-truck driver1 s7 s4 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s4)
   goals met: 18 of 44
63. (drive-truck driver1 s4 s8 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s8)
   goals met: 18 of 44
64. (unload-truck s8 package35 truck5)
   deleted: (in package35 truck5)
   added: (at package35 s8)
   goals met: 19 of 44
65. (drive-truck driver1 s8 s1 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s1)
   goals met: 19 of 44
66. (walk driver4 s4 p4-7)
   deleted: (at driver4 s4)
   added: (at driver4 p4-7)
   goals met: 19 of 44
67. (walk driver4 p4-7 s7)
   deleted: (at driver4 p4-7)
   added: (at driver4 s7)
   goals met: 19 of 44
68. (load-truck s7 package31 truck4)
   deleted: (at package31 s7)
   added: (in package31 truck4)
   goals met: 19 of 44
69. (board-truck driver4 s7 truck4)
   deleted: (at driver4 s7) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 19 of 44
70. (drive-truck driver4 s7 s1 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s1)
   goals met: 19 of 44
71. (drive-truck driver4 s1 s8 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s8)
   goals met: 19 of 44
72. (load-truck s8 package33 truck4)
   deleted: (at package33 s8)
   added: (in package33 truck4)
   goals met: 19 of 44
73. (unload-truck s8 package31 truck4)
   deleted: (in package31 truck4)
   added: (at package31 s8)
   goals met: 20 of 44
74. (load-truck s8 package2 truck4)
   deleted: (at package2 s8)
   added: (in package2 truck4)
   goals met: 20 of 44
75. (drive-truck driver4 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 20 of 44
76. (unload-truck s1 package2 truck4)
   deleted: (in package2 truck4)
   added: (at package2 s1)
   goals met: 21 of 44
77. (drive-truck driver4 s1 s5 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   goals met: 21 of 44
78. (unload-truck s5 package33 truck4)
   deleted: (in package33 truck4)
   added: (at package33 s5)
   goals met: 22 of 44
79. (load-truck s5 package12 truck4)
   deleted: (at package12 s5)
   added: (in package12 truck4)
   goals met: 22 of 44
80. (drive-truck driver4 s5 s7 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   goals met: 22 of 44
81. (load-truck s7 package15 truck4)
   deleted: (at package15 s7)
   added: (in package15 truck4)
   goals met: 22 of 44
82. (drive-truck driver4 s7 s1 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s1)
   goals met: 22 of 44
83. (drive-truck driver4 s1 s3 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   goals met: 22 of 44
84. (unload-truck s3 package15 truck4)
   deleted: (in package15 truck4)
   added: (at package15 s3)
   goals met: 23 of 44
85. (drive-truck driver4 s3 s1 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   goals met: 23 of 44
86. (drive-truck driver4 s1 s8 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s8)
   goals met: 23 of 44
87. (load-truck s8 package14 truck4)
   deleted: (at package14 s8)
   added: (in package14 truck4)
   goals met: 23 of 44
88. (drive-truck driver4 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 23 of 44
89. (drive-truck driver4 s1 s7 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s7)
   goals met: 23 of 44
90. (unload-truck s7 package14 truck4)
   deleted: (in package14 truck4)
   added: (at package14 s7)
   goals met: 24 of 44
91. (drive-truck driver4 s7 s4 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s4)
   goals met: 24 of 44
92. (unload-truck s4 package12 truck4)
   deleted: (in package12 truck4)
   added: (at package12 s4)
   goals met: 25 of 44
93. (drive-truck driver4 s4 s8 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   goals met: 25 of 44
94. (drive-truck driver4 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 25 of 44
95. (disembark-truck driver4 s1 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 26 of 44
96. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 26 of 44
97. (load-truck s2 package18 truck5)
   deleted: (at package18 s2)
   added: (in package18 truck5)
   goals met: 26 of 44
98. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 26 of 44
99. (drive-truck driver1 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 26 of 44
100. (unload-truck s0 package18 truck5)
   deleted: (in package18 truck5)
   added: (at package18 s0)
   goals met: 27 of 44
101. (drive-truck driver1 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 28 of 44
102. (unload-truck s3 package10 truck5)
   deleted: (in package10 truck5)
   added: (at package10 s3)
   goals met: 29 of 44
103. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 28 of 44
104. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 28 of 44
105. (drive-truck driver1 s1 s5 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s5)
   goals met: 28 of 44
106. (unload-truck s5 package26 truck5)
   deleted: (in package26 truck5)
   added: (at package26 s5)
   goals met: 29 of 44
107. (drive-truck driver1 s5 s4 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   goals met: 29 of 44
108. (drive-truck driver1 s4 s7 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s7)
   goals met: 29 of 44
109. (unload-truck s7 package16 truck5)
   deleted: (in package16 truck5)
   added: (at package16 s7)
   goals met: 30 of 44
110. (drive-truck driver1 s7 s4 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s4)
   goals met: 30 of 44
111. (drive-truck driver1 s4 s8 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s8)
   goals met: 30 of 44
112. (unload-truck s8 package17 truck5)
   deleted: (in package17 truck5)
   added: (at package17 s8)
   goals met: 31 of 44
113. (drive-truck driver1 s8 s1 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s1)
   goals met: 31 of 44
114. (drive-truck driver1 s1 s6 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s6)
   goals met: 31 of 44
115. (disembark-truck driver1 s6 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s6) (empty truck5)
   goals met: 32 of 44
116. (board-truck driver1 s6 truck3)
   deleted: (at driver1 s6) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 31 of 44
117. (drive-truck driver1 s6 s5 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   goals met: 31 of 44
118. (drive-truck driver1 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 32 of 44
119. (disembark-truck driver1 s4 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 32 of 44
120. (walk driver1 s4 p4-6)
   deleted: (at driver1 s4)
   added: (at driver1 p4-6)
   goals met: 32 of 44
121. (drive-truck driver5 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 32 of 44
122. (unload-truck s0 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s0)
   goals met: 33 of 44
123. (drive-truck driver5 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 33 of 44
124. (drive-truck driver5 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 33 of 44
125. (unload-truck s2 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s2)
   goals met: 34 of 44
126. (drive-truck driver5 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 34 of 44
127. (drive-truck driver5 s1 s8 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s8)
   goals met: 34 of 44
128. (unload-truck s8 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s8)
   goals met: 35 of 44
129. (drive-truck driver5 s8 s1 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s1)
   goals met: 35 of 44
130. (drive-truck driver5 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 35 of 44
131. (unload-truck s6 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s6)
   goals met: 36 of 44
132. (drive-truck driver5 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 36 of 44
133. (drive-truck driver5 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 37 of 44
134. (drive-truck driver5 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 36 of 44
135. (unload-truck s4 package28 truck1)
   deleted: (in package28 truck1)
   added: (at package28 s4)
   goals met: 37 of 44
136. (drive-truck driver5 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 37 of 44
137. (unload-truck s7 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s7)
   goals met: 38 of 44
138. (drive-truck driver5 s7 s1 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   goals met: 38 of 44
139. (drive-truck driver5 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 38 of 44
140. (unload-truck s6 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s6)
   goals met: 39 of 44
141. (disembark-truck driver5 s6 truck1)
   deleted: (driving driver5 truck1)
   added: (at driver5 s6) (empty truck1)
   goals met: 39 of 44
142. (walk driver1 p4-6 s6)
   deleted: (at driver1 p4-6)
   added: (at driver1 s6)
   goals met: 40 of 44
143. (board-truck driver1 s6 truck1)
   deleted: (at driver1 s6) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 39 of 44
144. (board-truck driver5 s6 truck5)
   deleted: (at driver5 s6) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 39 of 44
145. (drive-truck driver1 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 39 of 44
146. (drive-truck driver5 s6 s1 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s1)
   goals met: 39 of 44
147. (drive-truck driver1 s1 s8 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s8)
   goals met: 39 of 44
148. (unload-truck s8 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s8)
   goals met: 40 of 44
149. (drive-truck driver1 s8 s4 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   goals met: 40 of 44
150. (disembark-truck driver1 s4 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 40 of 44
151. (walk driver1 s4 p4-6)
   deleted: (at driver1 s4)
   added: (at driver1 p4-6)
   goals met: 40 of 44
152. (walk driver1 p4-6 s6)
   deleted: (at driver1 p4-6)
   added: (at driver1 s6)
   goals met: 41 of 44
153. (walk driver6 s3 p0-3)
   deleted: (at driver6 s3)
   added: (at driver6 p0-3)
   goals met: 41 of 44
154. (walk driver6 p0-3 s0)
   deleted: (at driver6 p0-3)
   added: (at driver6 s0)
   goals met: 41 of 44
155. (walk driver6 s0 p0-4)
   deleted: (at driver6 s0)
   added: (at driver6 p0-4)
   goals met: 41 of 44
156. (walk driver6 p0-4 s4)
   deleted: (at driver6 p0-4)
   added: (at driver6 s4)
   goals met: 41 of 44
157. (board-truck driver6 s4 truck1)
   deleted: (at driver6 s4) (empty truck1)
   added: (driving driver6 truck1)
   goals met: 41 of 44
158. (drive-truck driver6 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 42 of 44
159. (disembark-truck driver6 s3 truck1)
   deleted: (driving driver6 truck1)
   added: (at driver6 s3) (empty truck1)
   goals met: 42 of 44
160. (walk driver6 s3 p0-3)
   deleted: (at driver6 s3)
   added: (at driver6 p0-3)
   goals met: 42 of 44
161. (walk driver6 p0-3 s0)
   deleted: (at driver6 p0-3)
   added: (at driver6 s0)
   goals met: 42 of 44
162. (walk driver6 s0 p0-1)
   deleted: (at driver6 s0)
   added: (at driver6 p0-1)
   goals met: 42 of 44
163. (walk driver6 p0-1 s1)
   deleted: (at driver6 p0-1)
   added: (at driver6 s1)
   goals met: 42 of 44
164. (disembark-truck driver5 s1 truck5)
   deleted: (driving driver5 truck5)
   added: (at driver5 s1) (empty truck5)
   goals met: 43 of 44
165. (board-truck driver6 s1 truck5)
   deleted: (at driver6 s1) (empty truck5)
   added: (driving driver6 truck5)
   goals met: 43 of 44
166. (drive-truck driver6 s1 s3 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s3)
   goals met: 44 of 44
